In [1]:
import pandas as pd 
df1 = pd.read_csv('C:/database/france_murder.CSV',encoding ='cp949')

In [2]:
df1.head()

   Year  per 100000
0  2010        1.27
1  2011        1.36
2  2012        1.24
3  2013        1.23
4  2014        1.25

In [3]:
df1.drop([1,2,3,4,0,5,6,7,8,9,10], axis = 0, inplace=True)

In [4]:
df = df1.rename(columns = {'per 100000' : 'Count'})

In [5]:
df = df.mul(100000)
df.head()

         Year     Count
11  202100000  114000.0

In [6]:
df = df.drop(columns = ['Year'])
df.head()

       Count
11  114000.0

In [7]:
print(df)

       Count
11  114000.0

In [8]:
df2 = pd.read_csv('C:/database/france_rape.CSV', encoding = 'cp949')

In [9]:
df2.head()

   year      a 15-17 years Over 18 years   Total
0  2016  4,120       2,020         6,680  12,820
1  2017  4,760       2,400         7,770  14,930
2  2018  5,400       2,950         9,260  17,610
3  2020  6,710       3,980        12,080  22,770
4  2021  9,760       5,410        15,610  30,780

In [10]:
df2.drop([0,1,2,3], axis = 0 , inplace = True)

In [11]:
df2.head()

   year      a 15-17 years Over 18 years   Total
4  2021  9,760       5,410        15,610  30,780

In [12]:
df2 = df2.drop(columns = ['year','15-17 years','Over 18 years'])

In [13]:
df2 = df2.drop(columns = ['a'])

In [14]:
print(df2)

    Total
4  30,780

In [15]:
df2 = df2.rename(columns = {'Total' : 'Count'})

In [16]:
print(df2)

    Count
4  30,780

In [17]:
df3 = pd.read_csv('C:/database/france_theft.CSV', encoding = 'cp949')

In [18]:
df3.head()

,Year,Theft offences with weapons,Theft offences with violence but without weapons,Theft offences without violence
0,2017,10200,90300,719700
1,2018,9100,83700,708100
2,2019,9200,81500,728600
3,2020,8700,66100,553800
4,2021,8500,62100,583800

In [19]:
df3 = df3.drop(columns = ['Year'])
df3.head()

,Theft offences with weapons,Theft offences with violence but without weapons,Theft offences without violence
0,10200,90300,719700
1,9100,83700,708100
2,9200,81500,728600
3,8700,66100,553800
4,8500,62100,583800

In [20]:
df3['Count'] = df3.sum(axis='columns')
df3

,Theft offences with weapons,Theft offences with violence but without weapons,Theft offences without violence,Count
0,10200,90300,719700,820200
1,9100,83700,708100,800900
2,9200,81500,728600,819300
3,8700,66100,553800,628600
4,8500,62100,583800,654400
5,8600,59700,663700,732000
6,8700,54500,643000,706200

In [21]:
df3 = df3.drop([0,1,2,3,4,5])
df3

,Theft offences with weapons,Theft offences with violence but without weapons,Theft offences without violence,Count
6,8700,54500,643000,706200

In [22]:
df3 = df3.drop(columns = ['Theft offences with weapons'])

In [23]:
df3

,Theft offences with violence but without weapons,Theft offences without violence,Count
6,54500,643000,706200

In [24]:
df3 = df3.drop(columns = ['Theft offences without violence'])

In [25]:
df3

   Theft offences with violence but without weapons   Count
6                                             54500  706200

In [26]:
df3 = df3.drop(columns = ['Theft offences with violence but without weapons'])

In [27]:
df3

    Count
6  706200

In [28]:
df , df2 , df3

(       Count
 11  114000.0,
     Count
 4  30,780,
     Count
 6  706200)

In [29]:
final_df = pd.concat([df, df2, df3])

In [30]:
final_df

       Count
11  114000.0
4     30,780
6     706200

In [31]:
final_df = pd.DataFrame(final_df, index =['살인','강간','절도','폭행'])
final_df

   Count
살인   NaN
강간   NaN
절도   NaN
폭행   NaN

In [32]:
final_df = pd.DataFrame({ "Count" :{"살인" : 114000, "강간" : 30780 , "절도" : 706200,"폭행": 0}})

In [33]:
final_df

     Count
강간   30780
살인  114000
절도  706200
폭행       0

In [34]:
final_df = pd.DataFrame(final_df, index =['살인','강간','절도','폭행'])
final_df

     Count
살인  114000
강간   30780
절도  706200
폭행       0

In [35]:
population = pd.read_csv('C:/database/france_population.CSV', encoding = 'cp949')

In [36]:
population

   Year  Population
0  2021    64531444
1  2022    64626628
2  2023    64756584
3  2024    64881830

In [37]:
population = population.drop([1,2,3])

In [38]:
population

   Year  Population
0  2021    64531444

In [39]:
police = pd.read_csv('C:/database/france_police.CSV', encoding = 'cp949')

In [40]:
police

   Year Number of police officers
0  2012                   142,864
1  2013                   142,513
2  2014                   143,240
3  2015                   144,358
4  2016                   146,738
5  2017                   148,670
6  2018                   149,883
7  2019                   151,681
8  2020                   153,489
9  2021                    154547

In [41]:
police = police.drop([0,1,2,3,4,5,6,7,8])

In [42]:
police

   Year Number of police officers
9  2021                    154547

In [43]:
police_population = pd.concat([police,population])

In [44]:
police_population = police_population.drop(columns = 'Year')

In [45]:
police_population = pd.DataFrame(police_population, index = ['총경찰관수','총인구수'])

In [46]:
police_population = police_population.rename(columns = {'Population' : 'Count'})

In [47]:
police_population = police_population.drop(columns = 'Number of police officers')

In [48]:
police_population = pd.DataFrame({ 'Count' : { '총경찰관수' : 154547 , '총인구수':64531444}})

In [49]:
police_population

          Count
총경찰관수    154547
총인구수   64531444

In [50]:
cctv = pd.read_csv('C:/database/amount of cctv.CSV' , encoding = 'cp949')

In [51]:
cctv = cctv.drop(columns = '순위')

In [52]:
cctv = cctv.drop([0,1,2,3,4,6,7,8,9,10,11,12,13,14,15,16,17,18])

In [53]:
cctv_population = pd.concat([cctv,population])

In [54]:
cctv_population = cctv_population.drop(columns = '나라')

In [55]:
cctv_population = cctv_population.drop(columns = 'Year')

In [56]:
cctv_population = pd.DataFrame(cctv_population , index = ['총CCTV수','총인구수'])

In [57]:
cctv_population = cctv_population.drop(columns = 'CCTV 개수')

In [58]:
cctv_population = cctv_population.rename(columns = {'Population' : 'Count'})

In [59]:
cctv_population = pd.DataFrame({'Count' : {'총CCTV수': 1650000 ,'총인구수' :64531444}})

In [60]:
cctv_population

           Count
총CCTV수   1650000
총인구수    64531444

In [61]:
recidivism = pd.read_csv('C:/database/france_recidivism.CSV', encoding = 'cp949')

In [62]:
recidivism = recidivism.drop([0,1,2,3,4,5,6,7,8])

In [63]:
recidivism = recidivism.drop(columns = 'year ')

In [64]:
recidivism = pd.DataFrame(recidivism, index = ['재범률'])

In [65]:
recidivism = recidivism.rename(columns = {'recidivism rate' : 'Count'})

In [66]:
recidivism = pd.DataFrame({'Count': {'재범률': 14.6}})

In [67]:
recidivism

     Count
재범률   14.6

In [68]:
final_df

     Count
살인  114000
강간   30780
절도  706200
폭행       0

In [70]:
police_population

          Count
총경찰관수    154547
총인구수   64531444

In [71]:
cctv_population

           Count
총CCTV수   1650000
총인구수    64531444

In [72]:
recidivism

     Count
재범률   14.6

In [73]:
recidivism.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1 entries, 재범률 to 재범률
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Count   1 non-null      float64
dtypes: float64(1)
memory usage: 16.0+ bytes